<template>
  <div class="content-modal">
    <div class="content">
      <y-header>login</y-header>
      <div class="scroll-content" margin-tabbar margin-header>
        <p>
          魔界塔首饰改造加工方法大揭秘！是欧是非就看这一下啦~
          魔界塔塔花 魔界塔 11月21日
          游戏到后期，很多人都会接触到
          装备加工的概念
          通过不断地加工
          从而获取更好的装备
          这是变强不可避免的终极之路啊！
          装备加工有什么注意事项呢？
          什么样的词缀才是最好的呢？
          一起走进今日教程
          魔界塔首饰加工
          魔界塔首饰（戒指、项链）加工
          物等（物品等级）
          魔界塔装备的物等很重要，物等决定了装备词缀的等级上限，例如：同为龙晶指环，68物等的戒指，最高拥有T2阶段的词缀攻击最高为22 别的属性同理最高只是T2，而最高物等80级的戒指则可以洗出26攻击力的T1属性。
          底子
          是指首饰拥有的固定属性，例如龙晶指环拥有暴击率底子，末日护符拥有元素抗性底子 底子数值是没法洗的，数值是从装备掉落就固定的，在一定范围内波动，所以想要洗一个装备必须拥有一个好底子。
          前缀
          魔界塔装备的前缀属性包括： 攻击 生命 武技元素伤害 魔力 魔法伤害 闪避% 护甲% 追加元素伤害 护盾 伤害汲取生命 伤害汲取魔力。
          后缀
          魔界塔装备后缀属性包括：人物属性（敏捷力量智力）、单元素伤害、单元素抗性、元素抗性、暴击伤害、暴击率、命中、击中回血、全属性、每秒回复生命、击杀后回复生命、每秒回复魔力、击杀回复魔力。
          前缀和后缀的属性并不是固定的，无论是T1还是T2都是指一个区间，例如68物等攻击力前缀是XX（9.0-22.0）只需要后边有这个我们就可以确定它是T2词缀。
          升品
          魔界塔的通货是可以把一件装备由低品级升到高品级，最高为稀有，是使用8个炼金石（金手指）来升品的。
          蓝色品质升级稀有金色品质的时候，金色品质的装备继承蓝色装备属性，并随机增加属性（划重点，完全继承，就是说你蓝色首饰有22点攻击，那么升品之后的金色装备，必定有22点攻击这个属性，这也是我们做装备原理）。
          了解了上边这些基础知识那我们就可以来做一件心仪的强力首饰了！
          首先我们需要一个高物等的白色或蓝色品质的底子，比如戒指首推龙晶和花藤，龙晶底子最高可以达到无强化30%暴击几率 花藤可以得到4%额外物理伤害。
          找到一个高物等高底子属性的装备以后，如果它是白色品质那我们就可以使用1个附魔石把它升品到魔法品质（蓝色）。
          蓝色属性最多拥有一个前缀属性，一个后缀属性，最少拥有一个前缀，也就是说绝对不会有装备只拥有后缀属性而没有前缀属性，我们可以通过游戏的改造词缀功能，对刚打造的蓝色首饰进行洗练，洗出你想拥有的属性，例如68物等前缀T2属性攻击力+22和后缀T2属性 暴击伤害34%，这里需要注意的是，并不是一定要满属性，我们只需洗出T2词缀就可以，例如你可以洗出18攻击力（9-22）这个属性，这个就是T2的攻击力词缀，后期我们可以通过奇迹石，来洗出当前词缀的最高属性。注意是同时洗不出暴击率34%和暴击伤害34%这种俩个后缀属性的。
          洗好之后，我们要进行最重要的一步了，例如你拥有一个攻击力+19（9.0-22.0）的T2前缀和一个暴击伤害+32（30.0%-34.0%）的T2后缀。
          这个时候，我们就需要冷静冷静了，比如上个厕所，洗洗手，沐浴更衣，烧个香什么的。万事俱备，点击改造-属性-提升稀有度，因为蓝色品质的装备，最高只能拥有一个前缀一个后缀，但是稀有品质的装备是最多可以拥有三个前缀三个后缀的 ，能否赌出心仪的词缀，就看这一波了，究竟点出来的是前缀攻击力、生命、武技元素伤害，后缀为暴击率、暴击伤害、单元素伤害、这样的极品首饰，还是词缀无任何变化，完美镀金的首饰，就看这一波了。
          首饰洗好之后，我们就可以通过奇迹石来洗装备的属性数值，得到一件完美的强力首饰。
          最后，祝大家都做出心仪的T1首饰！
        </p>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data(){
    return {

    }
  }
};
</script>
<style lang="less" scoped>
</style>
